In [40]:
import pandas as pd

In [41]:
my_dict = {
    "name": ["Ahmed", "Alice", "Sean"],
    "age": [30, 35, 50],
    "city": ["LA", None, "Cairo"]
}

df = pd.DataFrame(my_dict)
df

    name  age   city
0  Ahmed   30     LA
1  Alice   35   None
2   Sean   50  Cairo

In [42]:
df.fillna("donno")

    name  age   city
0  Ahmed   30     LA
1  Alice   35  donno
2   Sean   50  Cairo

In [43]:
df.describe().T

     count       mean       std   min   25%   50%   75%   max
age    3.0  38.333333  10.40833  30.0  32.5  35.0  42.5  50.0

In [44]:
df["city"]

0       LA
1     None
2    Cairo
Name: city, dtype: object

In [45]:
df[df["age"] == 30]

    name  age city
0  Ahmed   30   LA

In [46]:
df.loc[0:1, ["city", "age"]]

   city  age
0    LA   30
1  None   35

In [47]:
df["salary"] = [10, 20 ,30]

In [48]:
df

    name  age   city  salary
0  Ahmed   30     LA      10
1  Alice   35   None      20
2   Sean   50  Cairo      30

In [49]:
df["age"] += 1

In [50]:
df["age"]

0    31
1    36
2    51
Name: age, dtype: int64

In [51]:
df.drop("salary", axis=1)

    name  age   city
0  Ahmed   31     LA
1  Alice   36   None
2   Sean   51  Cairo

In [53]:
data = pd.read_csv("employees.csv")
data.head()

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30

In [54]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            10 non-null     int64
 1   Name          10 non-null     object
 2   Department    10 non-null     object
 3   Age           10 non-null     int64
 4   Salary        10 non-null     int64
 5   Joining_Date  10 non-null     object
dtypes: int64(3), object(3)
memory usage: 612.0+ bytes

In [55]:
data.describe()

             ID        Age        Salary
count  10.00000  10.000000     10.000000
mean    5.50000  35.300000  68300.000000
std     3.02765   7.958922  13106.826042
min     1.00000  26.000000  50000.000000
25%     3.25000  29.250000  57250.000000
50%     5.50000  33.000000  69000.000000
75%     7.75000  40.250000  74250.000000
max    10.00000  50.000000  90000.000000

In [ ]:
data[data["Department"] == "IT"]

   ID          Name Department  Age  Salary Joining_Date
1   2    Jane Smith         IT   34   75000   2019-06-12
3   4   Alice White         IT   29   72000   2021-01-04
7   8  Linda Taylor         IT   26   64000   2022-02-10

In [71]:
data.groupby("Department")["Salary"].mean()

Department
Finance      87500.000000
HR           53000.000000
IT           70333.333333
Marketing    69000.000000
Name: Salary, dtype: float64

In [74]:
data["NewSalary"] = data["Salary"] * 1.05
data

   ID           Name Department  Age  Salary Joining_Date  NewSalary
0   1       John Doe         HR   28   50000   2020-05-21    52500.0
1   2     Jane Smith         IT   34   75000   2019-06-12    78750.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15    89250.0
3   4    Alice White         IT   29   72000   2021-01-04    75600.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30    71400.0
5   6      Eva Green         HR   41   54000   2017-04-22    56700.0
6   7     Mike Davis    Finance   50   90000   2016-08-19    94500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10    67200.0
8   9   James Wilson  Marketing   38   70000   2020-09-08    73500.0
9  10    Sarah Adams         HR   30   55000   2021-03-18    57750.0

In [82]:
sorted_data = data.sort_values("Age", ascending=False)
sorted_data

   ID           Name Department  Age  Salary Joining_Date  NewSalary
6   7     Mike Davis    Finance   50   90000   2016-08-19    94500.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15    89250.0
5   6      Eva Green         HR   41   54000   2017-04-22    56700.0
8   9   James Wilson  Marketing   38   70000   2020-09-08    73500.0
1   2     Jane Smith         IT   34   75000   2019-06-12    78750.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30    71400.0
9  10    Sarah Adams         HR   30   55000   2021-03-18    57750.0
3   4    Alice White         IT   29   72000   2021-01-04    75600.0
0   1       John Doe         HR   28   50000   2020-05-21    52500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10    67200.0

In [83]:
data["Department"].value_counts

<bound method IndexOpsMixin.value_counts of 0           HR
1           IT
2      Finance
3           IT
4    Marketing
5           HR
6      Finance
7           IT
8    Marketing
9           HR
Name: Department, dtype: object>

In [85]:
data["Joining_Date"] = pd.to_datetime(data["Joining_Date"])
data

   ID           Name Department  Age  Salary Joining_Date  NewSalary
0   1       John Doe         HR   28   50000   2020-05-21    52500.0
1   2     Jane Smith         IT   34   75000   2019-06-12    78750.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15    89250.0
3   4    Alice White         IT   29   72000   2021-01-04    75600.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30    71400.0
5   6      Eva Green         HR   41   54000   2017-04-22    56700.0
6   7     Mike Davis    Finance   50   90000   2016-08-19    94500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10    67200.0
8   9   James Wilson  Marketing   38   70000   2020-09-08    73500.0
9  10    Sarah Adams         HR   30   55000   2021-03-18    57750.0

In [86]:
data[data["Joining_Date"] > "2020"]

   ID          Name Department  Age  Salary Joining_Date  NewSalary
0   1      John Doe         HR   28   50000   2020-05-21    52500.0
3   4   Alice White         IT   29   72000   2021-01-04    75600.0
7   8  Linda Taylor         IT   26   64000   2022-02-10    67200.0
8   9  James Wilson  Marketing   38   70000   2020-09-08    73500.0
9  10   Sarah Adams         HR   30   55000   2021-03-18    57750.0

In [87]:
data.to_csv("saved.csv")